Repository: Gugunner/piix-app
Catalog: piix-app-flutter/lib/l10n/app_*.arb
Languages: es

source: Terms and Conditions
es: Términos y Condiciones

source: Verification code
es: Código de verificación

source: Required field
es: Campo obligatorio

# continued
source: Continue
es: Continuar

source: Retry
es: Reintentar

source: Edit
es: Editar

source: Confirm
es: Confirmar

source: Understood
es: Entendido

# viewSettings
source: View permissions
es: Ver configuración

source: Loading user information...
es: Cargando información del usuario...

# loadingMembershipInformation
source: Loading user membership...
es: Cargando información de la membresía...

source: Personal information
es: Información personal

source: Name
es: Nombre

source: Middle name
es: Segundo nombre

source: First last name
es: Primer apellido

source: Second last name
es: Segundo apellido

source: Email
es: Correo electrónico

source: Country code
es: Lada

source: Phone number
es: Teléfono

source: Date of birth
es: Fecha de nacimiento

source: Gender
es: Género

# preventBackWhileRequesting
source: Cannot go back while the app is requesting.
es: No puede regresar mientras la app tiene una peticion.

# invalidName
source: Must start with capital letter and have one space between them.
es: Deben empezar con mayúscula y estar separados por un espacio.

# loadContentError
source: We are sorry the content could not be loaded.
es: Lo sentimos, no se pudo cargar el contenido deseado.

# submitFormError
source: We are sorry the form could not be submitted. Please try again.
es: Lo sentimos, el formulario no pudo ser enviado. Por favor intentelo nuevamente.

# uploadCapturedImagesError
source: We are sorry, the captured images could not be uploaded. Please try again.
es: Lo sentimos, no se pudieron subir las imagenes capturadas. Por favor intentelo nuevamente.

# confirmInformationError
source: We are sorry, the information could not be confirmed. Please try again.
es: Lo sentimos ha ocurrido un error al confirmar. Inténtelo nuevamente.

source: Do you want to exit?
es: ¿Estás seguro de que deseas salir?

# byPressingAcceptYouExit
source: By pressing "Accept" you will exit the application.
es: Al presionar “Aceptar” saldrás de la aplicación.

source: Do you want to go back?
es: ¿Estás seguro de que deseas regresar?

# byPressingAcceptYouLooseProgress
source: By pressing "Accept" you will loose the progress made on this screen.
es: Al presionar "Aceptar" se perderá el progreso realizado en esta pantalla.

# careForEveryoneYouLove
source: Take care of everyone you love.
es: Cuida a todos los que amas.

source: Sign in
es: Inicia sesión

# signInInstructions
source: Enter the phone number used when you created your account. A verification code will be send via SMS.
es: Ingresa el número con el que te registraste. Se enviará un código de verificación por SMS.

source: Create account
es: Registrarme

# signUpInstructions
source: Enter a phone number. A verification code will be send via SMS.
es: Ingresa un número de teléfono. Te enviaremos un código de verificación por SMS.

# acceptByPhoneNumber
source: By providing your phone number you accept our
es: Al proporcionar tu número de teléfono, aceptas nuestros

source: Send code
es: Enviar código

# sendCodeError
source: The verification code coul not be sent. Please try again.
es: No se ha podido enviar el código de verificación. Intenta nuevamente.

source: Country
es: País

# invalidPhone
source: The phone number is not valid.
es: El télefono no es valido.

# registeredPhone
source: The phone number is already registered.
es: El teléfono ya esta registrado.

# unregisteredPhone
source: The phone number was not found.
es: No se encontro el teléfono ingresado.

# register
source: Create Account
es: Registrarme

# codeWasSuccessfullySentAgain
source: The verification code was succesfuly sent again.
es: Se ha reenviado exitosamente el código de verificación.

# whatsAppCodeWasSuccessfullySent
source: The verification code was succesfuly sent to WhatsApp.
es: Se ha enviado exitosamente el código por WhatsApp.

# unknownVerificationCodeError
source: We are sorry the verification code could not be verified. Please try again.
es: Lo sentimos no se pudo verificar el código. Por favor intenta nuevamente.

# verifyYourPhone
source: Verify your phone number
es: Verifica tu número de teléfono

# verifyYourNewPhone
source: Verify your new phone number
es: Verifica tu nuevo número de teléfono

# enterTheSentCode
source: Enter the code sent to
es: Ingresa el código enviado al

# wrongVerificationCode
source: The verification code is not correct.
es: El código de verificación no coincide.

# necessaryToFillField
source: It is necessary to fill this field
es: Es necesario llenar este campo

source: Did you not receive the code?
es: ¿No recibiste ningún código?

# inXTimeYouCan
source: In {xTime} minutes, you can
es: En {xTime} minutos, podrás

source: Request another code
es: Solicitar otro código

source: Send by WhatsApp
es: Enviar por WhatsApp

source: Verify number
es: Verificar número

source: Basic information
es: Información básica

# enterTheInformationRequired
source: Enter the information required to continue your account creation.
es: Ingresa la información que se te pide para continuar con tu registro.

# cannotCreateFile
source: The device could not create a readable file for the picture taken.
es: El dispositivo no pudo crear un archivo de lectura para la fotografía tomada.

# captureTimeOut
source: The camera is taking longer than usual to take the picture, the action has been canceled.
es: La camara esta tomando más tiempo que lo usual en tomar la foto, la acción se ha cancelado..

# captureFailure
source: The picture could not be taken.
es: La fotografía no pudo ser tomada.

# unknownCameraError
source: We are sorry, there was an unknown error with the camera.
es: Lo sentimos, ha ocurrido un error desconocido con la camara.

# cameraAccessDenied
source: To use the camera, please provide access to the camera and microphone.
es: Para usar la camara por favor otorgue accceso a la camara y al microfono.

# zoomError
source: The camera cannot zoom or the zoom level selected is not allowed.
es: La camara no puede hacer el acercamiento or el nivel de acercamiento seleccionado no esta permitido.

source: Upload photographs
es: Carga de fotografías

# makeSureToUploadRequestedImages
source: Make sure to upload all requested photographs.
es: Asegurate de cargar las fotografías que se piden a continuación.

# takeAPictureOfYourOfficialIdentification
source: Take a picture of your official identification with photograph.
es: Toma una foto de tu identificación oficial con fotografía.

# takeAPictureOfYourselfWithOfficialIdentification
source: Take a selfie of you holding an official identification with photograph.
es: Tomate una selfie al lado de tu identificación oficial con fotografía.

# takeAPhoto
source: Take photo
es: Tomar una foto

source: Replace photo
es: Reemplazar foto

# placeYourIdentification
source: Take a picture of your identification.
es: Enfoca aquí tu identificación oficial.

# placeYourFaceAndId
source: Take a picture of your face and hold your identification.
es: Enfoca aquí tu rostro sosteniendo tu identificación oficial.

# areYouSureToDelete
source: Do you want to delete the image?
es: ¿Estás seguro de que quieres eliminar la imagen?

# byPressingAcceptYouDeletePicture
source: By pressing "Accept" the image will be deleted and cannot be recovered.
es: Al presionar "Aceptar" se eliminará y no podrás recuperar la imagen.

# confirmTheEnteredInformation
source: Confirm the entered information to finish creating an account.
es: Confirma los datos que has registrado, para terminar con el proceso de registro.

# officialIdentificationImage
source: Official identification image with your photograph.
es: Imagen de una identificación oficial con fotografía.

# selfieBesideYourOfficialIdentification
source: Selfie beside your official identification with photograph.
es: Selfie al lado de la identificación oficial con fotografía.

# acceptByConfirmingInformation
source: By confirming the information you accept the
es: Al confirmar la información aceptas los

# ofTheMembershipCreatedForYou
source: of the membership created for you in Piix.
es: de la membresía que se crea para ti dentro de Piix.

# weReceivedYourInformation
source: Thanks, we have received your information.
es: ¡Gracias, hemos recibido tu información!

# yourInformationIsBeingRevised
source: Your personal information is now being revised by the Piix Team.
es: Tu información personal está siendo revisada por el equipo de PIIX.

source: Do you have an invitation code?
es: ¿Cuentas con un código de invitación?

source: Enter code
es: INGRESAR CÓDIGO

source: We are reviewing your information
es: Estamos revisando tus datos

# piixTeamIsReviewingYourInformation
source: Currently the PIIX team is reviewing your information. We''ll send you an email druing the following days to confirm the creation of your membership.
es: El equipo PIIX está revisando tus datos, te enviaremos un correo dentro de los próximos días confirmando la creación de tu membresía.

source: Membership
es: Membresía

source: Piix membership
es: Membresía Piix

source: Member since
es: Miembro desde

# blankMembership
source: We could not find any membership information.
es: No hemos encontrado información de una membresía.

source: Request ID
es: ID de solicitud

source: My Group
es: Mi grupo

# totalUsers
source: {count, plural, =0{no users} =1{1 user} other{{count} users}}
es: {count, plural, =0{sin usuarios} =1{1 usuario} other{{count} usuarios}}

source: Store
es: Tienda

source: Profile
es: Perfil

source: Loading
es: Cargando

source: Main holder
es: Titular

source: Active
es: Activa

source: Inactive
es: Inactiva

source: My membership
es: Mi membresía

source: Manage my group
es: Gestionar mi grupo

# improveMembership
source: Improve my membership
es: Mejorar mi membresía

source: Notifications
es: Notificaciones

source: My purchases
es: Mis compras

source: My requests
es: Mis solicitudes

# contact
source: Contact us
es: Contacto

source: Sign out
es: Cerrar sesión

source: Accept
es: Aceptar

source: Cancel
es: Cancelar

# alreadyUsedEmail
source: The email is already in use.
es: El correo electrónico ya esta en uso.

# unregisteredEmail
source: The email is not registered.
es: El correo electrónico no esta registrado.

# invalidEmail
source: The email is invalid.
es: El correo electrónico no es valido.

# emptyField
source: The field must not be empty.
es: El campo no puede estar vacio.

source: Password
es: Contraseña

source: Confirm password
es: Confirmar contraseña

source: Show password
es: Ver contraseña

# invalidPassword
source: Please check password before submitting again.
es: Por favor revisa la contraseña antes de volverla a envíar.

# passwordInstructions
source: The password must contain at least one lowercase, one uppercase, one number and one special character and be of minimum {minLength} and maximum {maxLength} characters.
es: La contraseña debe contener al menos una mayúscula, una minúscula, un número y un carácter especial, con un mínimo de {minLength} y máximo de {maxLength} caracteres.

# wrongMinLength
source: The field must be at least {minLength} characters.
es: El campo debe tener al menos {minLength} caracteres.

# wrongMaxLength
source: The field must be at most {maxLength} characters.
es: El campo debe tener no más de {maxLength} caracteres.

# numberInputInstructions
source: The value must be between {minValue} and {maxValue}.
es: El valor debe estar entre {minValue} y {maxValue}.

# wrongMinValue
source: The value must be equal or greater than {minValue}.
es: El valor debe ser mayor o igual a {minValue}.

# wrongMaxValue
source: The value must be equal or less than {maxValue}.
es: El valor debe ser menor o igual a {maxValue}.

# percentageOver100
source: Percentage values cannot be over 100
es: Los valores de porcentajes no pueden ser mayores a 100

# percentageUnder0
source: Percentage values cannot be below 0
es: Los valores de porcentajes no pueden ser menores a 0

# helloUser
source: Hello {shortName}
es: Hola, {shortName}

# yourPiixMembership
source: Your Piix membership has:
es: Tu membresía Piix cuenta con:

# myAssistanceCount
source: My assistances ({count})
es: Mis asistencias ({count})

source: Link membership
es: Vincular membresía

source: Unlink membership
es: Desvincular membresía

source: Learn more
es: Conoce más

source: Link your membership
es: Vincula tu membresía

# linkToYourGroupOrCommunity
source: With your family group or community, to acquire the assistances and the coverage.
es: Con tu grupo familiar o comunidad, para adquirir las asistencias y la cobertura.

# hiAgain
source: Hello again!
es: ¡Hola de nuevo!

# exploreMyAssistances
source: Explore “My assistances” where you will find the assistances included in your membership.
es: Explora “Mis asistencias”, donde encontrarás las asistencias incluidas en tu membresía.

source: Meet the store
es: Conoce la tienda

# complementYourCoverage
source: Complement your coverage. Find exclusive assistances inside the Piix store.
es: Complementa tu cobertura. Encuentra asistencias exclusivas en la tienda Piix.

# whereToBuy
source: Where to buy assistances?
es: ¿Dónde comprar asistencias?

# howToRequestAssistance
source: How to request an assistance?
es: ¿Cómo solicitar una asistencia?

# enterStore
source: Enter the Piix Store
es: Ingresa a la tienda Piix

# fromTheStoreExplore
source: From the store, explore how to improve your coverage with the assistances Piix has to offer.
es: Desde la sección de Tienda, explora las asistencias que tiene PIIX para mejorar tu cobertura.

source: Add events
es: Agrega eventos

# improveYourCoverage
source: Improve your coverage by customizing the number of events per assistance.
es: Mejora tu cobertura personalizando la cantidad de eventos para tu asistencia.

source: Quote and pay
es: Cotiza y paga

# generatePaymentLine
source: Generate the payment line and pay online or in any of the authorized pay points.
es: Genera la línea de captura y realiza el pago en línea o en cualquiera de los puntos autorizados.

source: Go to store
es: Ir a la tienda

# fromTheAssistanceList
source: From the list of assistances
es: Desde la lista de asistencias

# requestDirectly
source: Request directly the assistance. Consider that some assistances have age or usage limits.
es: Solicita directamente la asistencia. Considera que algunas asistencias tienen restricciones como edad o límite de eventos a usar.

source: Inside the assistance detail
es: Dentro del detalle de asistencia

# fromAnyAssistance
source: From any assistance in your membership. Find your assistances in “My assistances”.
es: Desde cualquier asistencia en tu membresía. Encuentra tus asistencias en “Mis asistencias”.

source: Important
es: Importante

# toBeAbleToRequest
source: To be able to reques an assistance, it must be active and have no pending actions.
es: Para poder realizar una solicitud, tu asistencia tiene que estar activa y sin acciones pendientes.

# enterInvitationCode
source: Enter the invitation code
es: Ingresa el código de invitación

source: Entered invitation code
es: Código de invitación ingresado

# linkupYourMembershipInstructions
source: Linkup your Piix membership to a family group or community to start using the assistances shared with you.
es: Vincula tu membresía PIIX a tu grupo familiar o comunidad para adquirir las asistencias que esta te ofrece.

# howToLinkupMyMembership
source: How to link my membership?
es: ¿Cómo puedo vincularme?

source: To a family group
es: A un grupo familiar

# enterTheCodeAFamilyMember
source: Entering the invitation code that a family member shared with you to join the group.
es: ngresando el código de invitación que un familiar o ser querido te compartió para unirte a su grupo.

source: To a community
es: A una comunidad

# ifYouBelongToACommunity
source: If you belong to a community that gave you an invitation code, enter the code and get access to their assistances.
es: Si perteneces a una comunidad que te ha proporcionado un código de invitación, ingrésalo y disfruta de sus asistencias.

# makeSureToLinkupYourMembership
source: Make sure to linkup your membership to the correct family group or community. Please check the information before confirming the linkage.
es: Asegúrate de vincular tu membresía al Grupo familiar o Comunidad correcta. Revisa la información antes de confirmar.

source: Edit code
es: Editar código

# linkUpTo
source: Linkup to a {linkupType}
es: {linkupType} a vincular

# ifNotYourMembershipLinkage
source: If this is not your {linkupType}, check the invitation code and try again.
es: Si no es tu {linkupType}, revisa e ingresa nuevamente el código de invitación.

# sendInvitationalCode
source: Send invitation code
es: Envíar código de invitación

source: Confirm linkage
es: Confirmar vinculación

source: Community
es: Comunidad

source: Family group
es: Grupo familiar

# invalidCodeFormat
source: Invalid code format. Please only enter numbers and letters.
es: Formato incorrecto. Por favor ingresa sólo números y letras.

# invalidLinkupCode
source: We could not find anything related with this invitation code, check that the code is correct and try again.
es: No hemos encontrado nada relacionado con este código de invitación, revísalo e ingrésalo de nuevo.

# userIsAlreadyInCommunity
source: You are already in a community and cannot linkup to a new one at this moment.
es: Ya estas en una comunidad y no puedes vincularte a una nueva comunidad en este momento.

# userCannotUseSlot
source: You can not use this invitation code since you do not meet the requirements of age or gender.
es: No puedes usar este código de invitación porque no cumples los requsitos de la edad o el género.

# userIsAlreadyInGroup
source: You are already in a family group and cannot linkup to a new one at this moment.
es: Ya estas en un grupo familiar y no puedes vincularte a un nuevo grupo familiar en este momento.

# slotIsNotOpen
source: The invitation code you are trying to use is no longer valid.
es: El código de invitación que estas intentando usar ya no es válido.

# checkLinkupCodeError
source: We are sorry, the invitation code could not complete the validation process. Please try again.
es: Lo sentimos, no se pudo completar el proceso para validar el código de invitación. Inténtelo nuevamente.

# linkupCodeError
source: We are sorry, the invitation code could not be assigned. Please try again.
es: Lo sentimos, el código de invitación no pudo ser asignado. Inténtelo nuevamente.

# successfulFamilyGroupLinkupMessage
source: Successful linkage to the family group of "{linkupTo}"
es: Vinculación exitosa al grupo familiar de "{linkupTo}"

# successfulCommunityLinkupMessage
source: Successful linkage to the community "{linkupTo}"
es: Vinculación exitosa a la comunidad "{linkupTo}"

# theFamilyGroupInvitationCodeHasBeenValidated
source: The family group invitation code has been validated and the membership linkage is successful. Now you have access to the assistances of {linkupTo}''s family group.
es: El código de invitación de grupo familiar ha sido validado y la vinculación de membresía ha terminado exitosamente. Ahora cuentas con las asistencias del grupo familiar de {linkupTo}.

# theCommunityInvitationCodeHasBeenValidated
source: The community invitation code has been validated and the membership linkage is successful. Now you have access to the assistances of the community {linkupTo}.
es: El código de invitación de comunidad ha sido validado y la vinculación de membresía ha terminado exitosamente. Ahora cuentas con las asistencias de la comunidad {linkupTo}.
