Repository: Gugunner/piix-app
Catalog: piix-app-flutter/lib/intl/app_intl_*.arb
Languages: es

# copyright
source: Copyright Â© {year} Piix
es: Piix © {year} Todos los derechos reservados.

source: Terms of Service
es: Términos y Condiciones de Uso

source: Privacy Policy
es: Políticas de Privacidad

# readAndAcceptTermsAndPrivacy
source: I have read and accept the Terms of Service and Privacy Policy.
es: He leido y acepto los Términos y Condiciones de Uso y las Políticas de Privacidad.

source: Enter your email
es: Ingresa tu correo

# unknownError
source: We are sorry an unknown error has occured.
es: Lo sentimos ha ocurrido un error inesperado.

source: Seems you are lost
es: Parece que te has perdido

source: Welcome to Piix
es: Bienvenido a Piix

source: Create an account with us
es: Crea una cuenta con nosotros

# manageYourMembershipAndInviteOthers
source: Manage your assistances and invite other to join your family protection.
es: Administra tus asistencias e invita a otros a que se unan a tu protección familiar.

# verifyYourEmailAndCreateAccount
source: Verify your email to create an account.
es: Verifica tu correo para crear una cuenta.

# loginWithAOneTimeCodeWithEmail
source: Login with a one time code using your email.
es: Inicia sesión usando tu correo y un código de único uso.

# enterYourEmailForVerfication
source: Enter your email for verification.
es: Ingresa tu correo para verificación.

source: Send code
es: Enviar código

source: Verify email
es: Verificar correo

source: Don''t have an account?
es: No tienes una cuenta?

source: Already have an account?
es: Ya tienes una cuenta?

source: Sign up
es: Registrate

source: Sign in
es: Inicia sesión

source: Login
es: Iniciar sesión

source: Create account
es: Crear cuenta

# enterTheEmailYouUsed
source: Enter the email you used when creating the account to receive a verification code.
es: Ingresa el correo electrónico con el que creaste la cuenta para recibir un código de verificación.

# verifyYourEmailByEntering
source: Verify your email by entering a code to create an account.
es: Verifica tu correo electrónico para crear una cuenta.

source: Protect the ones you love
es: Protege a los que más amas

source: Enter the verification code
es: Ingresa el código de verificación

# enterTheCodeSentTo
source: Enter the code sent to {email}
es: Ingresa el código enviado a {email}

source: Verification code
es: Código de verificación

# didNotReceiveACode
source: Didn''t receive a code?
es: ¿No recibiste ningún código?

# inXMinYouCan
source: In {min} min. you can
es: En {min} min. podrás

source: Request a new code
es: Solicitar otro código

source: Verify code
es: Verificar código

# emptyEmailField
source: The email field cannot be empty.
es: El campo del correo no puede estar vacio.

# invalidEmail
source: The email is invalid.
es: El correo es invalido.

# emailAlreadyExists
source: The email is already in use.
es: El correo ya esta en uso.

# emailNotFound
source: The email could not be found.
es: No se encontro el correo ingresado.

# incorrectVerificationCode
source: The code is incorrect
es: El código es incorrecto
